* Introduction to C++
  [[https://codeacademy.com/courses/learn-c-plus-plus/lessons/cpp-hello-world/exercises/introduction][Link to course]]

  C++ is a programming language created by Bjarne Stroustrup and his
  team at Bell Laboratories in 1979. Forty years later, it is one of
  the most widely used languages in the world; we can find C++
  applications everywhere, from the bottom of the oceans to the
  surface of Mars.

  As the name implies, C++ was derived from the C language; Bjarne’s
  goal was to add object-oriented programming into C, a language
  well-respected for its portability and low-level functionality.

  So why learn C++? Among many other things:

  It is fast and flexible.  It is well-supported.  It forces you to
  think in new and creative ways.  In this lesson, we’ll start
  learning some basic concepts, and you’ll write your very first C++
  program.

  Note: Don’t worry if some words don’t make much sense right
  now. We’ll learn about them in a bit!

* First programs

  This code chunk includes a trivial ~int main() { }~ function call

  #+begin_src C :includes <stdio.h>
    int a=1;
    int b=1;
    printf("%d\n", a+b);
  #+end_src

  #+RESULTS:
  : 2

  This works under Linux.

  #+begin_src C++ :includes <iostream>
    std::cout<< "1\n";
  #+end_src

  #+RESULTS:
